import { GetServerSidePropsContext } from "next";

export async function getListSSRProps(context: GetServerSidePropsContext) {
  const response = {
    results: [
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-1.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-2.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-3.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-4.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-5.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-6.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-7.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
      {
        description: "2021.05.17 23:25",
        image: "/images/recom-8.svg",
        title:
          "魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメ魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ…魚を食べて頭もカラダも元気に！知っておきたい魚を食べるメリ",
        tags: ["魚料理", "和食", "DHA"],
      },
    ],
  };
  return {
    props: {
      listNews: response.results,
    },
  };
}
